//Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
//ЭТО ФАЙЛ С НОРМАЛЬНЫМ РЕШЕНИЕМ, ФАЙЛ С РЕШЕНИЕМ КАК ВАМ НАДО - ДАЛЬШЕ И НАЗЫВАЕТСЯ 2nd_dodic, 
// впредь прошу разрешить писать меньше кода, если известен оператор. У меня на это три аргумента:
// -- на самом деле мы больше учимся, когда гуглим решения, а не на семинаре, несмотря на то, что вы прекрасны
// -- учится гуглить важнее любого из скиллов программиста, кроме умения пользоваться дезодорантом
// -- искать решения, не которые требуются - а которые приходят в голову - полезнее, чем использовать паттерны с семинаров
Console.Write("Введите Первое число и нажмите энтер: ");
int FirstNumber = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите Второе число и нажмите энтер: ");
int SecondNumber = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите Третье число и нажмите энтер: ");
int ThirdNumber = Convert.ToInt32(Console.ReadLine());
int[] i = {FirstNumber, SecondNumber, ThirdNumber};
int max = i.Max();
Console.WriteLine($"max = {max}");
